zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc54xxx/pinctrl/LPC54005JBD100-pinctrl.h
#define PINT_PINT7_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define SCT0_OUT5_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 4) /* PIO0_26 */
#define SPIFI_CLK_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 6) /* PIO0_26 */
#define USB0_IDVALUE_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 7) /* PIO0_26 */
#define ADC0_TRIG1_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define ADC0_TRIG2_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define CTIMER3_MATCH2_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 3) /* PIO0_27 */
#define DMA0_TRIG0_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG10_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG11_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG12_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG13_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG14_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG15_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG16_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG17_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG18_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG19_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG1_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG20_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG21_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG22_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG23_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG24_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG25_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG26_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG27_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG28_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG29_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG2_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG3_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG4_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG5_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG6_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG7_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG8_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA0_TRIG9_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMIC0_DATA0_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 5) /* PIO0_27 */
#define FC2_TXD_SCL_MISO_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 1) /* PIO0_27 */
#define GPIO_PIO027_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT_PINT0_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT_PINT1_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT_PINT2_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT_PINT3_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT_PINT4_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT_PINT5_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT_PINT6_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT_PINT7_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define SCT0_OUT6_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 4) /* PIO0_27 */
#define SPIFI0_SPIFI_IO3_PIO0_27 IOCON_MUX(27, IOCON_TYPE_D, 6) /* PIO0_27 */
#define ADC0_TRIG1_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define ADC0_TRIG2_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define CTIMER2_CAPTURE3_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define DMA0_TRIG0_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG10_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG11_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG12_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG13_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG14_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG15_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG16_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG17_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG18_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG19_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG1_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG20_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG21_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG22_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG23_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG24_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG25_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG26_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG27_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG28_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG29_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG2_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG3_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG4_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG5_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG6_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG7_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG8_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA0_TRIG9_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define FC0_SCK_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 1) /* PIO0_28 */
#define GPIO_PIO028_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT_PINT0_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT_PINT1_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT_PINT2_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT_PINT3_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT_PINT4_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT_PINT5_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT_PINT6_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT_PINT7_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define SCT0_OUT7_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 4) /* PIO0_28 */
#define SPIFI0_SPIFI_IO2_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 6) /* PIO0_28 */
#define SWD_TRACEDATA3_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 5) /* PIO0_28 */
#define USB0_OVERCURRENTN_PIO0_28 IOCON_MUX(28, IOCON_TYPE_D, 7) /* PIO0_28 */
#define ADC0_TRIG1_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define ADC0_TRIG2_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define CTIMER2_MATCH3_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 3) /* PIO0_29 */
#define DMA0_TRIG0_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG10_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG11_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG12_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG13_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG14_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG15_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG16_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG17_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG18_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG19_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG1_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG20_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG21_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG22_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG23_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG24_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG25_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG26_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG27_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG28_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG29_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG2_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG3_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG4_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG5_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG6_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG7_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG8_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA0_TRIG9_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define FC0_RXD_SDA_MOSI_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 1) /* PIO0_29 */
#define GPIO_PIO029_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT_PINT0_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT_PINT1_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT_PINT2_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT_PINT3_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT_PINT4_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT_PINT5_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT_PINT6_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT_PINT7_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define SCT0_OUT8_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 4) /* PIO0_29 */
#define SWD_TRACEDATA2_PIO0_29 IOCON_MUX(29, IOCON_TYPE_D, 5) /* PIO0_29 */
#define ADC0_TRIG1_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define ADC0_TRIG2_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define CTIMER0_MATCH0_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 3) /* PIO0_30 */
#define DMA0_TRIG0_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG10_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG11_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG12_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG13_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG14_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG15_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG16_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG17_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG18_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG19_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG1_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG20_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG21_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG22_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG23_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG24_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG25_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG26_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG27_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG28_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG29_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG2_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG3_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG4_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG5_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG6_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG7_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG8_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA0_TRIG9_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define FC0_TXD_SCL_MISO_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 1) /* PIO0_30 */
#define GPIO_PIO030_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT_PINT0_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT_PINT1_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT_PINT2_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT_PINT3_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT_PINT4_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT_PINT5_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT_PINT6_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT_PINT7_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define SCT0_OUT9_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 4) /* PIO0_30 */
#define SWD_TRACEDATA1_PIO0_30 IOCON_MUX(30, IOCON_TYPE_D, 5) /* PIO0_30 */
#define ADC0_CH5_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define ADC0_TRIG1_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define ADC0_TRIG2_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define CTIMER0_MATCH1_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 3) /* PIO0_31 */
#define DMA0_TRIG0_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG10_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG11_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG12_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG13_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG14_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG15_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG16_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG17_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG18_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG19_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG1_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG20_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG21_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG22_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG23_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG24_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG25_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG26_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG27_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG28_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG29_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG2_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG3_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG4_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG5_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG6_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG7_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG8_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define DMA0_TRIG9_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define FC0_CTS_SDA_SSEL0_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 1) /* PIO0_31 */
#define GPIO_PIO031_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define PINT_PINT0_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define PINT_PINT1_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define PINT_PINT2_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define PINT_PINT3_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define PINT_PINT4_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define PINT_PINT5_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define PINT_PINT6_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define PINT_PINT7_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 0) /* PIO0_31 */
#define SCT0_OUT3_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 4) /* PIO0_31 */
#define SDIF_SD_D2_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 2) /* PIO0_31 */
#define SWD_TRACEDATA0_PIO0_31 IOCON_MUX(31, IOCON_TYPE_D, 5) /* PIO0_31 */
#define ADC0_CH6_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define ADC0_TRIG1_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define ADC0_TRIG2_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define CTIMER0_CAPTURE2_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 3) /* PIO1_0 */
#define DMA0_TRIG0_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG10_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG11_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG12_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG13_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG14_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG15_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG16_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG17_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG18_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG19_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG1_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG20_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG21_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG22_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG23_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG24_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG25_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG26_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG27_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG28_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG29_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG2_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG3_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG4_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG5_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG6_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG7_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG8_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define DMA0_TRIG9_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define FC0_RTS_SCL_SSEL1_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 1) /* PIO1_0 */
#define GPIO_PIO10_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define PINT_PINT0_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define PINT_PINT1_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define PINT_PINT2_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define PINT_PINT3_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define PINT_PINT4_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define PINT_PINT5_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define PINT_PINT6_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define PINT_PINT7_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 0) /* PIO1_0 */
#define SCT0_IN0_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 4) /* PIO1_0 */
#define SCT0_IN1_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 4) /* PIO1_0 */
#define SCT0_IN2_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 4) /* PIO1_0 */
#define SCT0_IN3_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 4) /* PIO1_0 */
#define SCT0_IN4_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 4) /* PIO1_0 */
#define SCT0_IN5_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 4) /* PIO1_0 */
#define SCT0_IN6_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 4) /* PIO1_0 */
#define SDIF_SD_D3_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 2) /* PIO1_0 */
#define TRACECLK_PIO1_0 IOCON_MUX(32, IOCON_TYPE_D, 5) /* PIO1_0 */
#define ADC0_TRIG1_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define ADC0_TRIG2_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define CTIMER0_CAPTURE3_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 3) /* PIO1_1 */
#define DMA0_TRIG0_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG10_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG11_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG12_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG13_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG14_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG15_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG16_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG17_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG18_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG19_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG1_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG20_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG21_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG22_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG23_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG24_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG25_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG26_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG27_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG28_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG29_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG2_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG3_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG4_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG5_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG6_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG7_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG8_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA0_TRIG9_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define FC10_RXD_SDA_MOSI_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 6) /* PIO1_1 */
#define FC3_RXD_SDA_MOSI_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 1) /* PIO1_1 */
#define GPIO_PIO11_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT_PINT0_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT_PINT1_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT_PINT2_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT_PINT3_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT_PINT4_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT_PINT5_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT_PINT6_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT_PINT7_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 0) /* PIO1_1 */
#define SCT0_IN0_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 4) /* PIO1_1 */
